Repository: jardahrazdera/portfolio-jaroslav-tech
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: cs

source: Activate 'Coming Soon' Mode
cs: Aktivovat režim 'Brzy spustíme'

source: If checked, visitors will see the 'Coming Soon' overlay instead of the main site content.
cs: Pokud je zaškrtnuto, návštěvníci uvidí překryvnou vrstvu 'Brzy spustíme' namísto hlavního obsahu webu.

source: Site Setting
cs: Nastavení stránky

source: Site Settings
cs: Nastavení stránek

source: Toggle theme
cs: Přepnout motiv

source: Coming soon
cs: Brzy spustíme

source: I'm working on it :)
cs: Pracuji na tom :)

source: About
cs: O mně

source: Skills
cs: Dovednosti

source: Projects
cs: Projekty

source: Contact
cs: Kontakt

source: Open menu
cs: Otevřít menu

source: All rights reserved.
cs: Všechna práva vyhrazena.

source: Catppuccin Mocha Theme
cs: Motiv Catppuccin Mocha

source: Hello, I'm Jarek.
cs: Ahoj, jsem Jarek.

source: I build robust backends and elegant web solutions. Passionate about clean code and object-oriented principles. I actively use AI as a tool to boost my productivity and explore creative solutions.
cs: Tvořím robustní backendy a elegantní webová řešení. Jsem nadšený do čistého kódu a objektově orientovaných principů. Aktivně využívám AI jako nástroj pro zvýšení své produktivity a objevování kreativních řešení.

source: View My Work
cs: Zobrazit mé práce

source: Get In Touch
cs: Kontaktujte mě

source: About Me
cs: O mně

source: <p>I am a developer from the Czech Republic, driven by a passion for transforming complex problems into elegant software solutions. My focus is on building robust and maintainable applications using Python, with practical experience in frameworks like Django and Flask. I am proficient in crafting user interfaces with HTML, CSS, and JavaScript, and I am committed to applying the principles of Object-Oriented Programming to write clean and scalable code. My choice of Manjaro Sway as a daily driver reflects my philosophy: I thrive in efficient, terminal-centric environments that give me full control over my workflow.</p>
cs: <p>Jsem vývojář z České republiky, poháněný vášní pro přeměnu komplexních problémů v elegantní softwarová řešení. Soustředím se na tvorbu robustních a udržitelných aplikací v Pythonu, s praktickými zkušenostmi ve frameworcích jako Django a Flask. Ovládám tvorbu uživatelských rozhraní pomocí HTML, CSS a JavaScriptu a věnuji se aplikaci principů objektově orientovaného programování pro psaní čistého a škálovatelného kódu. Moje volba Manjaro Sway jako hlavního systému odráží mou filozofii: daří se mi v efektivním, terminálově orientovaném prostředí, které mi dává plnou kontrolu nad mým workflow.</p>

source: My Skillset
cs: Moje dovednosti

source: Responsive Design
cs: Responzivní Design

source: DevOps & Tooling
cs: DevOps & Nástroje

source: The Portfolio Meta-Project
cs: Meta-projekt Portfolia

source: What better showcases my skills than the very page presenting them? This entire website, from code to deployment, is my project. It all runs on my own server using virtualization, which I personally manage, and demonstrates the practical use of technologies like Python, Django, Docker, and CI/CD to build a complete, robust solution.
cs: Co lépe ukáže mé schopnosti než samotná stránka, která je prezentuje? Celý tento web, od kódu až po nasazení, je můj projekt. Vše běží na mém vlastním serveru s pouzitim virtualizace, který si sám spravuji, a demonstruje to praktické využití technologií jako Python, Django, Docker a CI/CD k vytvoření kompletního a robustního řešení.

source: Technologies:
cs: Technologie:

source: Live Demo
cs: Živá ukázka

source: Personal Dashboard 'Freedom Hub'
cs: Osobní Dashboard 'Freedom Hub'

source: A self-hosted dashboard to reclaim control over my digital world. Instead of dozens of tabs, this app brings RSS feeds, weather, to-do lists, quick notes into one fully customizable space and many more. It's a step towards digital independence, built with Django and a touch of JavaScript for interactive widgets.
cs: Self-hostovaný dashboard pro znovuzískání kontroly nad mým digitálním světem. Místo desítek záložek přináší tato aplikace RSS kanály, počasí, úkoly, rychlé poznámky do jednoho plně přizpůsobitelného prostoru a mnoho dalšího.Je to krok k digitální nezávislosti, postavený na Djangu s kapkou JavaScriptu pro interaktivní widgety.

source: In Development
cs: Ve vývoji

source: CLI Toolbox
cs: Sada CLI nástrojů

source: A curated collection of small, useful Python scripts designed for the command line. From automating boring tasks to simple data processing, this toolbox is my personal testament to the power and elegance of scripting. More tools to be added soon.
cs: Kolekce malých, užitečných Python skriptů navržených pro příkazovou řádku. Od automatizace nudných úkolů po jednoduché zpracování dat, tato sada nástrojů je mým osobním svědectvím o síle a eleganci skriptování. Další nástroje budou brzy přidány.

source: Idea Stage
cs: Ve fázi nápadu

source: Contact Me
cs: Kontaktujte mě

source: I'm currently looking for new opportunities. Feel free to reach out!
cs: Momentálně hledám nové příležitosti. Neváhejte se ozvat!

source: Visit my GitHub profile
cs: Navštivte můj profil na GitHub

source: Visit my LinkedIn profile
cs: Navštivte můj profil na LinkedIn
